%%
%ä½œç”¨ï¼š æ±‚å››å…ƒæ•°æ—‹è½¬çŸ©é˜µ  
%è¯´æ˜ï¼š æ‰€æœ‰å››å…ƒæ•°éƒ½ä¸ºå•ä½å››å…ƒæ•°

<<<<<<< HEAD
%¶¨Òå£º ËÄÔªÊıµÄËÄ¸ö·ÖÁ¿ q = a + b*i + c*j + d*k
 syms a b c d ; %ÓÃÓÚ¼ÆËãÈ·¶¨Ã¿¸öµ¥ÖáµÄĞı×ª¾ØÕó

%¶¨Òå±¾Ìå¶¯Ì¬×ø±ê³õÊ¼×´Ì¬ , v0 = x0*i + y0*j + z0*k
% global x0;
% global y0;
% global z0;
% x0 = 1;
% y0 = 1;
% z0 = 1;
% fprintf('¶¨Òå³õÊ¼×´Ì¬¶ÔÓ¦µÄ´¿ËÄÔªÊıÎª£º\n')
% fprintf('\t v0 = x0*i + y0*j + z0*k \n')
% fprintf('¸Ã×´Ì¬¶ÔÓ¦µÄ¾ØÕóÎª£º\n')
% v0 =[x0    0      0;
%      0     y0     0;
%      0     0      z0]

%%
% %ÇóÃ¿¸öÖáÏòĞı×ª¶ÔÓ¦µÄËÄÔªÊıĞı×ª¾ØÕóĞÎÊ½£¬Çó½âºóĞè×¢ÊÍ¶ÔÓ¦¶Î
% % Cz ±íÊ¾ ÈÆZÖá cos(theta)   Sz ±íÊ¾ ÈÆZÖá sin(theta) 
% %¶¨ÒåÈÆzÖáĞı×ªµÄ½Ç¶ÈºÍÖá
 syms Cz Sz ;
% a=Cz;
=======
%å®šä¹‰ï¼š å››å…ƒæ•°çš„å››ä¸ªåˆ†é‡ q = a + b*i + c*j + d*k
% syms a b c d ; %ç”¨äºè®¡ç®—ç¡®å®šæ¯ä¸ªå•è½´çš„æ—‹è½¬çŸ©é˜µ

%å®šä¹‰æœ¬ä½“åŠ¨æ€åæ ‡åˆå§‹çŠ¶æ€ , v0 = x0*i + y0*j + z0*k
global x0;
global y0;
global z0;
x0 = 1;
y0 = 1;
z0 = 1;
fprintf('å®šä¹‰åˆå§‹çŠ¶æ€å¯¹åº”çš„çº¯å››å…ƒæ•°ä¸ºï¼š\n')
fprintf('\t v0 = x0*i + y0*j + z0*k \n')
fprintf('è¯¥çŠ¶æ€å¯¹åº”çš„çŸ©é˜µä¸ºï¼š\n')
v0 =[x0    0      0;
     0     y0     0;
     0     0      z0]

%%
% %æ±‚æ¯ä¸ªè½´å‘æ—‹è½¬å¯¹åº”çš„å››å…ƒæ•°æ—‹è½¬çŸ©é˜µå½¢å¼ï¼Œæ±‚è§£åéœ€æ³¨é‡Šå¯¹åº”æ®µ
% %å®šä¹‰ç»•zè½´æ—‹è½¬çš„è§’åº¦å’Œè½´
 syms cos_rz sin_rz ;
% a=cos_rz;
>>>>>>> 4a61336b380e37151bc4d5507b9195a4f98125cd
% b=0;
% c=0;
% d=Sz;

<<<<<<< HEAD
% %¶¨ÒåÈÆyÖáĞı×ªµÄ½Ç¶ÈºÍÖá
 syms Cy Sy;
% a=Cy;
=======
% %å®šä¹‰ç»•yè½´æ—‹è½¬çš„è§’åº¦å’Œè½´
 syms cos_ry sin_ry;
% a=cos_ry;
>>>>>>> 4a61336b380e37151bc4d5507b9195a4f98125cd
% b=0;
% c=-Sy;
% d=0;

<<<<<<< HEAD
% %¶¨ÒåÈÆxÖáĞı×ªµÄ½Ç¶ÈºÍÖá
syms Cx Sx;
% a=Cx;
% b=1*Sx;
=======
% %å®šä¹‰ç»•xè½´æ—‹è½¬çš„è§’åº¦å’Œè½´
syms cos_rx sin_rx;
% a=cos_rx;
% b=1*sin_rx;
>>>>>>> 4a61336b380e37151bc4d5507b9195a4f98125cd
% c=0;
% d=0;

%å®šä¹‰q1_L,q1_Råˆ†åˆ«ä¸ºå¯¹åº”å››å…ƒæ•°å·¦ä¹˜å³ä¹˜çš„å·¦ä¹˜çŸ©é˜µå½¢å¼
% q_1= [a -b -c -d;    
%       b a -d c;
%       c d a -b;
%       d -c b a ];
%   
% q_2= [a  -b  -c  -d;
%       b  a    d  -c;
%       c  -d   a   b;
%       d  c   -b   a];
% %å–q_2çš„è½¬ç½®ï¼Œä¸ºä»€ä¹ˆå–å‘¢ï¼Œå¾…è§£é‡Š
% q2 = [a b c d;
%     -b a -d c;
%     -c d a -b;
%     -d -c b a];
% q = q_1*q2

%%
%åˆå§‹åŒ–ä¸‰ä¸ªè½´æ—‹è½¬çš„è§’åº¦
global theta_z;
global theta_y;
global theta_x;
global oper_z;
global oper_y;
global oper_x;
%Éè¶¨½Ç¶ÈµÄ³Ë»ıËã×Ó
oper_z = 1/3; 
oper_y = 1/3;
oper_x = 0;
%µÃµ½Ïà¶ÔÓ¦µÄ theta/2
theta_z = pi*oper_z;
theta_y = pi*oper_y;
theta_x = pi*oper_x;

%Èı½Çº¯ÊıÔËËã¸³Öµ
% Cz = cos(theta_z);
% Sz = sin(theta_z);
% Cy = cos(theta_y);
% Sy = sin(theta_y);
% Cx = cos(theta_x);
% Sx = sin(theta_x);

<<<<<<< HEAD
%¶¨Òå½øĞĞĞı×ªµÄĞı×ª¾ØÕó    »¯Îª3*3µÄ¾ØÕó
%¶ÔËùÓĞµÄ2±¶½Ç¹«Ê½½øĞĞÕûÀí£¬Òª×¢ÒâµÄÒ»¸öµØ·½¾ÍÊÇ:
%   Cz^2-Sz^2=cos(2*theta_z) ÕâÀïÊ¹ÓÃCzÖ±½Ó±íÊ¾cos(2*theta_z)
%   2*Sz*Cz=sin(2*theta_z) ÕâÀïÊ¹ÓÃSzÖ±½Ó±íÊ¾sin(2*theta_z)

%ÈÆzÖáĞı×ª
%  q_z = [Cz^2 - Sz^2,    -2*Cz*Sz,                     0;
%         2*Cz*Sz,        Cz^2 - Sz^2,                  0;
%         0                                   0,                        1];
 Q_Z= [Cz -Sz 0;
       Sz  Cz 0;
       0   0  1];
    

% ÈÆyÖáĞı×ª
%  q_y = [Cy^2 - Sy^2,                     0,      2*Cy*Sy;
%                             0, Cy^2 + Sy^2,                    0;
%            -2*Cy*Sy,                     0,  Cy^2 - Sy^2];
Q_Y = [Cy , 0 ,Sy;
       0 , 1 ,0;
       -Sy , 0, Cy];
 

%ÈÆxÖáĞı×ª
%  q_x = [  1,           0,           0;
%           0, Cx^2 - Sx^2,    -2*Cx*Sx;
%           0,     2*Cx*Sx, Cx^2 - Sx^2];

Q_X = [1,0,0;
       0, Cx,-Sx;
       0, Sx,Cx];
%ÈÆ±¾Ìå¹ßĞÔ²Î¿¼ÏµÈı¸öÖáÏò¸´ºÏĞı×ªºóµÄ¾ØÕó£¬Ğı×ªË³ĞòÎª x -> y -> z
%ÒòÎªËÄÔªÊıµÚÒ»¸ö´ú±íµÄÊÇcos(theta/2),Èç¹û¸øtheta£¬ÓÉÓÚËÄÔªÊı±¾ÉíµÄË«±¶¸²¸Ç
%¸øtheta»áÊ¹µÃÊµ¼ÊĞı×ª½ÇÎª  2*theta
% global oper_rad2deg %»¡¶ÈÖµ×ª½Ç¶ÈÖµ
% oper_rad2deg = 360 /(2*pi);
% fprintf('ÈÆzÖáĞı×ª½Ç¶È£º%d ¶È\n',2*oper_z*oper_rad2deg)   
% fprintf('ÈÆyÖáĞı×ª½Ç¶È£º%d ¶È\n',2*oper_y*oper_rad2deg)
% fprintf('ÈÆxÖáĞı×ª½Ç¶È£º%d ¶È\n',2*oper_x*oper_rad2deg)

fprintf('ËÄÔªÊı¸´ºÏĞı×ª¾ØÕóÎª£º')
%rotate = q_z * q_y *q_x

%ÓëÅ·À­½ÇÏà¶ÔÓ¦µÄĞı×ª¾ØÕó
Rotate = Q_Z * Q_Y * Q_X
% %Ğı×ªºóµÄ×´Ì¬
% fprintf('Ğı×ªºóµÃµ½µÄ¾ØÕóÎª£º\n')
% v_after_rotate = rotate * v0

%%
%%¿ØÖÆ²¿·Ö  ´ıĞ´
%ËÄÔªÊı²îÖµ¼ÆËã

%PID¿ØÖÆ

%¸üĞÂËÄÔªÊı

%¿ØÖÆÁ¿Êä³ö





=======
%å®šä¹‰è¿›è¡Œæ—‹è½¬çš„æ—‹è½¬çŸ©é˜µ    åŒ–ä¸º3*3çš„çŸ©é˜µ
%zè½´æ—‹è½¬
 q_z = [cos_rz^2 - sin_rz^2,    -2*cos_rz*sin_rz,                     0;
        2*cos_rz*sin_rz,        cos_rz^2 - sin_rz^2,                  0;
        0                                   0,                        1];

%ç»•yè½´æ—‹è½¬
 q_y = [cos_ry^2 - sin_ry^2,                     0,      2*cos_ry*sin_ry;
                            0, cos_ry^2 + sin_ry^2,                    0;
           -2*cos_ry*sin_ry,                     0,  cos_ry^2 - sin_ry^2];

%zè½´æ—‹è½¬
 q_x = [  1,                     0,                 0;
          0, cos_rx^2 - sin_rx^2,    -2*cos_rx*sin_rx;
          0,     2*cos_rx*sin_rx, cos_rx^2 - sin_rx^2];
      
%ç»•æœ¬ä½“æƒ¯æ€§å‚è€ƒç³»ä¸‰ä¸ªè½´å‘å¤åˆæ—‹è½¬åçš„çŸ©é˜µï¼Œæ—‹è½¬é¡ºåºä¸º z -> y -> x
%å› ä¸ºå››å…ƒæ•°ç¬¬ä¸€ä¸ªä»£è¡¨çš„æ˜¯cos(theta/2),å¦‚æœç»™thetaï¼Œç”±äºå››å…ƒæ•°æœ¬èº«çš„åŒå€è¦†ç›–
%ç»™thetaä¼šä½¿å¾—å®é™…æ—‹è½¬è§’ä¸º  2*theta
fprintf('ç»•zè½´æ—‹è½¬è§’åº¦ï¼š%d\n',2*theta_z)
fprintf('ç»•yè½´æ—‹è½¬è§’åº¦ï¼š%d\n',2*theta_y)
fprintf('ç»•xè½´æ—‹è½¬è§’åº¦ï¼š%d\n',2*theta_x)

fprintf('æ—‹è½¬çŸ©é˜µä¸ºï¼š')
rotate = q_z * q_y *q_x
%æ—‹è½¬åçš„çŠ¶æ€
fprintf('æ—‹è½¬åå¾—åˆ°çš„çŸ©é˜µä¸ºï¼š\n')
v_after_rotate = rotate * v0 
>>>>>>> 4a61336b380e37151bc4d5507b9195a4f98125cd

